duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
/*
* Copyright (c) 2019 Nordic Semiconductor ASA
*
* SPDX-License-Identifier: LicenseRef-BSD-5-Clause-Nordic
*/
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/types.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/pm/device.h>
#include <stdio.h>
#include <string.h>
#include "logger.h"
#include "transfer_cache.h"
#include "datetime.h"
#include "Settings.h"
#include "Uart_ble.h"
#ifdef CONFIG_TOUCH_SUPPORT
#include "CST816.h"
#endif
#include "gps.h"
#include "max20353.h"
#ifdef CONFIG_PPG_SUPPORT
#include "max32674.h"
#endif
#include "screen.h"
#include "inner_flash.h"
#ifdef CONFIG_WIFI_SUPPORT
#include "esp8266.h"
#endif

//#define UART_DEBUG

#if DT_NODE_HAS_STATUS(DT_NODELABEL(uart2), okay)
#define BLE_DEV DT_NODELABEL(uart2)
#else
#error "uart2 devicetree node is disabled"
#define BLE_DEV	""
#endif

#if DT_NODE_HAS_STATUS(DT_NODELABEL(gpio0), okay)
#define BLE_PORT DT_NODELABEL(gpio0)
#else
#error "gpio0 devicetree node is disabled"
#define BLE_PORT	""
#endif


#define BLE_INT_PIN		27
#define BLE_WAKE_PIN	25

#define BUF_MAXSIZE	4096

#define PACKET_HEAD	0xAB
#define PACKET_END	0x88

#define BLE_WORK_MODE_ID			0xFF10			//52810工作状态正常
#define GET_WIFI_VER_ID				0xFF11			//获取WIFI版本信息
#define GET_WIFI_MAC_ID				0xFF12			//获取WIFI Mac address信息
#define SET_WIFI_OFF_ID				0xFF13			//关闭WIFI
#define SET_WIFI_ON_ID				0xFF14			//打开WIFI
#define GET_WIFI_AP_ID				0xFF15			//扫描附近可用的WIFI APS
#define SEND_WIFI_DATA_ID			0xFE16			//通过WIFI透传数据
#define SET_WIFI_CONNECTED_AP_ID	0xFF17			//设置WIFI透传连接的AP信息
#define SET_WIIF_CONNECTED_SEVER_ID	0xFF18			//设置WIFI透传连接的后台信息
#define HEART_RATE_ID				0xFF31			//心率
#define BLOOD_OXYGEN_ID				0xFF32			//血氧
#define BLOOD_PRESSURE_ID			0xFF33			//血压
#define TEMPERATURE_ID				0xFF62			//体温
#define	ONE_KEY_MEASURE_ID			0xFF34			//一键测量
#define	PULL_REFRESH_ID				0xFF35			//下拉刷新
#define	SLEEP_DETAILS_ID			0xFF36			//睡眠详情
#define	FIND_DEVICE_ID				0xFF37			//查找手环
#define SMART_NOTIFY_ID				0xFF38			//智能提醒
#define	ALARM_SETTING_ID			0xFF39			//闹钟设置
#define USER_INFOR_ID				0xFF40			//用户信息
#define	SEDENTARY_ID				0xFF41			//久坐提醒
#define	SHAKE_SCREEN_ID				0xFF42			//抬手亮屏
#define	MEASURE_HOURLY_ID			0xFF43			//整点测量设置
#define	SHAKE_PHOTO_ID				0xFF44			//摇一摇拍照
#define	LANGUAGE_SETTING_ID			0xFF45			//中英日文切换
#define	TIME_24_SETTING_ID			0xFF46			//12/24小时设置
#define	FIND_PHONE_ID				0xFF47			//查找手机回复
#define	WEATHER_INFOR_ID			0xFF48			//天气信息下发
#define	TIME_SYNC_ID				0xFF49			//时间同步
#define	TARGET_STEPS_ID				0xFF50			//目标步数
#define	BATTERY_LEVEL_ID			0xFF51			//电池电量
#define	FIRMWARE_INFOR_ID			0xFF52			//固件版本号
#define	FACTORY_RESET_ID			0xFF53			//清除手环数据
#define	ECG_ID						0xFF54			//心电
#define	LOCATION_ID					0xFF55			//获取定位信息
#define	DATE_FORMAT_ID				0xFF56			//年月日格式设置
#define NOTIFY_CONTENT_ID			0xFF57			//智能提醒内容
#define CHECK_WHITELIST_ID			0xFF58			//判断手机ID是否在手环白名单
#define INSERT_WHITELIST_ID`		0xFF59			//将手机ID插入白名单
#define DEVICE_SEND_128_RAND_ID		0xFF60			//手环发送随机的128位随机数
#define PHONE_SEND_128_AES_ID		0xFF61			//手机发送AES 128 CBC加密数据给手环

#define	BLE_CONNECT_ID				0xFFB0			//BLE断连提醒
#define	CTP_NOTIFY_ID				0xFFB1			//CTP触屏消息
#define GET_BLE_VER_ID				0xFFB2			//获取52810版本号
#define GET_BLE_MAC_ADDR_ID			0xFFB3			//获取BLE MAC地址
#define GET_BLE_STATUS_ID			0xFFB4			//获取BLE当前工作状态	0:关闭 1:休眠 2:广播 3:连接
#define SET_BEL_WORK_MODE_ID		0xFFB5			//设置BLE工作模式		0:关闭 1:打开 2:唤醒 3:休眠

bool blue_is_on = true;
bool get_ble_info_flag = false;
#ifdef CONFIG_PM_DEVICE
bool uart_ble_sleep_flag = false;
bool uart_ble_wake_flag = false;
bool uart_ble_is_waked = true;
#define UART_BLE_WAKE_HOLD_TIME_SEC		(10)
#endif
static bool reply_cur_data_flag = false;
static bool uart_send_data_flag = false;
static bool uart_rece_data_flag = false;
static bool uart_rece_frame_flag = false;

static CacheInfo uart_send_cache = {0};
static CacheInfo uart_rece_cache = {0};

sys_date_timer_t refresh_time = {0};

static bool redraw_blt_status_flag = false;

static ENUM_BLE_WORK_MODE ble_work_mode=BLE_WORK_NORMAL;

static uint32_t rece_len=0;
static uint32_t send_len=0;
static uint8_t rx_buf[BUF_MAXSIZE]={0};

static K_FIFO_DEFINE(fifo_uart_tx_data);
static K_FIFO_DEFINE(fifo_uart_rx_data);

static struct device *uart_ble = NULL;
static struct device *gpio_ble = NULL;
static struct gpio_callback gpio_cb;

static struct uart_data_t
{
	void  *fifo_reserved;
	uint8_t    data[BUF_MAXSIZE];
	uint16_t   len;
};

bool g_ble_connected = false;

uint8_t g_ble_mac_addr[20] = {0};
uint8_t g_nrf52810_ver[128] = {0};

ENUM_BLE_STATUS g_ble_status = BLE_STATUS_BROADCAST;
ENUM_BLE_MODE g_ble_mode = BLE_MODE_TURN_OFF;

extern bool app_find_device;

static void UartSendDataCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(uart_send_data_timer, UartSendDataCallBack, NULL);
static void UartReceDataCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(uart_rece_data_timer, UartReceDataCallBack, NULL);
static void UartReceFrameCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(uart_rece_frame_timer, UartReceFrameCallBack, NULL);

#ifdef CONFIG_PM_DEVICE
static void UartBleSleepInCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(uart_ble_sleep_in_timer, UartBleSleepInCallBack, NULL);
#endif

static void GetBLEInfoCallBack(struct k_timer *timer_id);
K_TIMER_DEFINE(get_ble_info_timer, GetBLEInfoCallBack, NULL);

#ifdef CONFIG_BLE_SUPPORT
void ble_connect_or_disconnect_handle(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("BLE status:%x", buf[6]);
#endif

	if(buf[6] == 0x01)				//查看control值
		g_ble_connected = true;
	else if(buf[6] == 0x00)
		g_ble_connected = false;
	else
		g_ble_connected = false;

	redraw_blt_status_flag = true;
}

#ifdef CONFIG_ALARM_SUPPORT
void APP_reply_find_phone(uint8_t *buf, uint32_t len)
{
	uint32_t i;

#ifdef UART_DEBUG
	LOGD("begin");
#endif
}

void APP_set_find_device(uint8_t *buf, uint32_t len)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG	
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (FIND_DEVICE_ID>>8);		
	reply[reply_len++] = (uint8_t)(FIND_DEVICE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

