duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_reply_cur_hour_temp(sys_date_timer_t time, uint8_t *data)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x0D;
	//data ID
	reply[reply_len++] = (PULL_REFRESH_ID>>8);		
	reply[reply_len++] = (uint8_t)(PULL_REFRESH_ID&0x00ff);
	//status
	reply[reply_len++] = 0x86;
	//control
	reply[reply_len++] = 0x00;
	//year
	reply[reply_len++] = (time.year-2000);
	//month
	reply[reply_len++] = time.month;
	//day
	reply[reply_len++] = time.day;
	//hour
	reply[reply_len++] = time.hour;
	//minute
	reply[reply_len++] = time.minute;
	//data
#ifdef UART_DEBUG
	LOGD("temp:%d.%d", (256*data[0]+data[1])/10, (256*data[0]+data[1])%10);
#endif
	reply[reply_len++] = data[0];
	reply[reply_len++] = data[1];
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void APP_get_cur_hour_health(sys_date_timer_t ask_time)
{
	uint8_t hr = 0,spo2 = 0;
	bpt_data bpt = {0};
	uint16_t temp = 0;
	uint8_t data[2] = {0};

#ifdef UART_DEBUG
	LOGD("begin");
#endif

#ifdef CONFIG_PPG_SUPPORT
	GetGivenTimeHrRecData(ask_time, &hr);
	GetGivenTimeSpo2RecData(ask_time, &spo2);
	GetGivenTimeBptRecData(ask_time, &bpt);
#endif
#ifdef CONFIG_TEMP_SUPPORT
	GetGivenTimeTempRecData(ask_time, &temp);
#endif

	MCU_reply_cur_hour_ppg(ask_time, PPG_DATA_HR, &hr);
	MCU_reply_cur_hour_ppg(ask_time, PPG_DATA_SPO2, &spo2);
	MCU_reply_cur_hour_ppg(ask_time, PPG_DATA_BPT, (uint8_t*)&bpt);

	data[0] = temp>>8;
	data[1] = (uint8_t)(temp&0x00ff);
	MCU_reply_cur_hour_temp(ask_time, data);
}

void APP_get_cur_hour_sport(sys_date_timer_t ask_time)
{
	uint8_t wake,reply[128] = {0};
	uint16_t steps=0,calorie=0,distance=0;
	uint16_t light_sleep=0,deep_sleep=0;	
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

#ifdef CONFIG_IMU_SUPPORT
#ifdef CONFIG_STEP_SUPPORT
	GetSportData(&steps, &calorie, &distance);
#endif
#ifdef CPNFIG_SLEEP_SUPPORT
	GetSleepTimeData(&deep_sleep, &light_sleep);
#endif
#endif
	
	wake = 8;
	
	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x11;
	//data ID
	reply[reply_len++] = (PULL_REFRESH_ID>>8);		
	reply[reply_len++] = (uint8_t)(PULL_REFRESH_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//Step
	reply[reply_len++] = (steps>>8);
	reply[reply_len++] = (uint8_t)(steps&0x00ff);
	//Calorie
	reply[reply_len++] = (calorie>>8);
	reply[reply_len++] = (uint8_t)(calorie&0x00ff);
	//Distance
	reply[reply_len++] = (distance>>8);
	reply[reply_len++] = (uint8_t)(distance&0x00ff);
	//Shallow Sleep
	reply[reply_len++] = (light_sleep>>8);
	reply[reply_len++] = (uint8_t)(light_sleep&0x00ff);
	//Deep Sleep
	reply[reply_len++] = (deep_sleep>>8);
	reply[reply_len++] = (uint8_t)(deep_sleep&0x00ff);
	//Wake
	reply[reply_len++] = wake;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void APP_get_cur_hour_data(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("%04d/%02d/%02d %02d:%02d", 2000 + buf[7],buf[8],buf[9],buf[10],buf[11]);
#endif

	refresh_time.year = 2000 + buf[7];
	refresh_time.month = buf[8];
	refresh_time.day = buf[9];
	refresh_time.hour = buf[10];
	refresh_time.minute = buf[11];

	reply_cur_data_flag = true;
}

void APP_get_location_data(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	ble_wait_gps = true;
	APP_Ask_GPS_Data();
}

void APP_get_gps_data_reply(bool flag, struct nrf_modem_gnss_pvt_data_frame gps_data)
{
	uint8_t tmpgps;
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;
	uint32_t tmp1;
	double tmp2;

	if(!flag)
		return;
	
	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x17;
	//data ID
	reply[reply_len++] = (LOCATION_ID>>8);		
	reply[reply_len++] = (uint8_t)(LOCATION_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	
	//UTC data&time
	//year
	reply[reply_len++] = gps_data.datetime.year>>8;
	reply[reply_len++] = (uint8_t)(gps_data.datetime.year&0x00FF);
	//month
	reply[reply_len++] = gps_data.datetime.month;
	//day
	reply[reply_len++] = gps_data.datetime.day;
	//hour
	reply[reply_len++] = gps_data.datetime.hour;
	//minute
	reply[reply_len++] = gps_data.datetime.minute;
	//seconds
	reply[reply_len++] = gps_data.datetime.seconds;
	
	//longitude
	tmpgps = 'E';
	if(gps_data.longitude < 0)
	{
		tmpgps = 'W';
		gps_data.longitude = -gps_data.longitude;
	}
	//direction	E\W
	reply[reply_len++] = tmpgps;
	tmp1 = (uint32_t)(gps_data.longitude); //经度整数部分
	tmp2 = gps_data.longitude - tmp1;	//经度小数部分
	//degree int
	reply[reply_len++] = tmp1;//整数部分
	tmp1 = (uint32_t)(tmp2*1000000);
	//degree dot1~2
	reply[reply_len++] = (uint8_t)(tmp1/10000);
	tmp1 = tmp1%10000;
	//degree dot3~4
	reply[reply_len++] = (uint8_t)(tmp1/100);
	tmp1 = tmp1%100;
	//degree dot5~6
	reply[reply_len++] = (uint8_t)(tmp1);	
	//latitude
	tmpgps = 'N';
	if(gps_data.latitude < 0)
	{
		tmpgps = 'S';
		gps_data.latitude = -gps_data.latitude;
	}
	//direction N\S
	reply[reply_len++] = tmpgps;
	tmp1 = (uint32_t)(gps_data.latitude);	//经度整数部分
	tmp2 = gps_data.latitude - tmp1;	//经度小数部分
	//degree int
	reply[reply_len++] = tmp1;//整数部分
	tmp1 = (uint32_t)(tmp2*1000000);
	//degree dot1~2
	reply[reply_len++] = (uint8_t)(tmp1/10000);
	tmp1 = tmp1%10000;
	//degree dot3~4
	reply[reply_len++] = (uint8_t)(tmp1/100);
	tmp1 = tmp1%100;
	//degree dot5~6
	reply[reply_len++] = (uint8_t)(tmp1);
					
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

