duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
		//Adjust data length
		reply[1] = (reply_len-3)>>8;
		reply[2] = (reply_len-3)&0x00ff;

		for(i=0;i<(reply_len-2);i++)
			reply[reply_len-2] += reply[i];

		BleSendData(reply, reply_len);	
	}
	else
	{
		uint8_t data[2] = {0};
		health_record_t last_data = {0};

		switch(buf[5])
		{
		case 0x01://实时测量体温
			APPStartTemp();
			break;

		case 0x02://单次测量体温
			get_cur_health_from_record(&last_data);
			data[0] = last_data.deca_temp>>8;
			data[1] = (uint8_t)(last_data.deca_temp&0x00ff);
			MCU_send_app_get_temp_data(data);
			break;
		}
	}
}
#endif

void MCU_get_ble_status(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x06;
	//data ID
	reply[reply_len++] = (GET_BLE_STATUS_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_BLE_STATUS_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

//手环查找手机
void MCU_send_find_phone(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	reply[reply_len++] = (FIND_PHONE_ID>>8);		
	reply[reply_len++] = (uint8_t)(FIND_PHONE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//data
	reply[reply_len++] = 0x01;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);	
}

//手环上报一键测量数据
void MCU_send_app_one_key_measure_data(void)
{
	uint8_t heart_rate,spo2,systolic,diastolic;
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	GetPPGData(&heart_rate, &spo2, &systolic, &diastolic);
	
	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x0A;
	//data ID
	reply[reply_len++] = (ONE_KEY_MEASURE_ID>>8);		
	reply[reply_len++] = (uint8_t)(ONE_KEY_MEASURE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x01;
	//data hr
	reply[reply_len++] = heart_rate;
	//data spo2
	reply[reply_len++] = spo2;
	//data systolic
	reply[reply_len++] = systolic;
	//data diastolic
	reply[reply_len++] = diastolic;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_send_app_get_ppg_data(PPG_DATA_TYPE flag, uint8_t *data)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	switch(flag)
	{
	case PPG_DATA_HR:
		reply[reply_len++] = (HEART_RATE_ID>>8);		
		reply[reply_len++] = (uint8_t)(HEART_RATE_ID&0x00ff);
		break;
	case PPG_DATA_SPO2:
		reply[reply_len++] = (BLOOD_OXYGEN_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_OXYGEN_ID&0x00ff);
		break;
	case PPG_DATA_BPT:
		reply[reply_len++] = (BLOOD_PRESSURE_ID>>8);		
		reply[reply_len++] = (uint8_t)(BLOOD_PRESSURE_ID&0x00ff);
		break;
	}
	//status
	reply[reply_len++] = 0x02;
	//control
	reply[reply_len++] = 0x01;
	switch(flag)
	{
	case PPG_DATA_HR:
		reply[reply_len++] = data[0];
		break;
	case PPG_DATA_SPO2:
		reply[reply_len++] = data[0];
		break;
	case PPG_DATA_BPT:
		reply[reply_len++] = data[0];		
		reply[reply_len++] = data[1];
		break;
	}
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_send_app_get_temp_data(uint8_t *data)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x07;
	//data ID
	reply[reply_len++] = (TEMPERATURE_ID>>8);		
	reply[reply_len++] = (uint8_t)(TEMPERATURE_ID&0x00ff);
	//status
	reply[reply_len++] = 0x02;
	//control
	reply[reply_len++] = 0x01;
	//tempdata
	reply[reply_len++] = data[0];		
	reply[reply_len++] = data[1];
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void nrf52810_report_work_mode(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("mode:%d", buf[5]);
#endif

	if(buf[5] == 1)
	{
		ble_work_mode = BLE_WORK_NORMAL;
	}
	else
	{
		ble_work_mode = BLE_WORK_DFU;
		if(g_ble_connected)
		{
			g_ble_connected = false;
			redraw_blt_status_flag = true;
		}
	}
}

void get_ble_status_response(uint8_t *buf, uint32_t len)
{
#ifdef UART_DEBUG
	LOGD("BLE_status:%d", buf[7]);
#endif

	g_ble_status = buf[7];

	switch(g_ble_status)
	{
	case BLE_STATUS_OFF:
	case BLE_STATUS_SLEEP:
	case BLE_STATUS_BROADCAST:
		g_ble_connected = false;
		break;

	case BLE_STATUS_CONNECTED:
		g_ble_connected = true;
		redraw_blt_status_flag = true;
		break;
	}
}
#endif

#ifdef CONFIG_TOUCH_SUPPORT
void CTP_notify_handle(uint8_t *buf, uint32_t len)
{
	uint8_t tp_type = TP_EVENT_MAX;
	uint16_t tp_x,tp_y;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	switch(buf[5])
	{
	case GESTURE_NONE:
		tp_type = TP_EVENT_NONE;
		break;
	case GESTURE_MOVING_UP:
		tp_type = TP_EVENT_MOVING_UP;
		break;
	case GESTURE_MOVING_DOWN:
		tp_type = TP_EVENT_MOVING_DOWN;
		break;
	case GESTURE_MOVING_LEFT:
		tp_type = TP_EVENT_MOVING_LEFT;
		break;
	case GESTURE_MOVING_RIGHT:
		tp_type = TP_EVENT_MOVING_RIGHT;
		break;
	case GESTURE_SINGLE_CLICK:
		tp_type = TP_EVENT_SINGLE_CLICK;
		break;
	case GESTURE_DOUBLE_CLICK:
		tp_type = TP_EVENT_DOUBLE_CLICK;
		break;
	case GESTURE_LONG_PRESS:
		tp_type = TP_EVENT_LONG_PRESS;
		break;
	}

