duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
	if(tp_type != TP_EVENT_MAX)
	{
		tp_x = (0x0f&buf[7])<<8 | buf[8];
		tp_y = (0x0f&buf[9])<<8 | buf[10];
		touch_panel_event_handle(tp_type, tp_x, tp_y);
	}
}
#endif

#ifdef CONFIG_WIFI_SUPPORT
void get_wifi_ver_response(uint8_t *buf, uint32_t len)
{
	uint32_t i;

	for(i=0;i<len-9;i++)
	{
		g_wifi_ver[i] = buf[7+i];
	}

#ifdef UART_DEBUG
	LOGD("g_wifi_ver:%s", g_wifi_ver);
#endif
}

void get_wifi_mac_response(uint8_t *buf, uint32_t len)
{
	uint32_t i;
	
	for(i=0;i<len-9;i++)
	{
		g_wifi_mac_addr[i] = buf[7+i];
	}

#ifdef UART_DEBUG
	LOGD("g_wifi_mac_addr:%s", g_wifi_mac_addr);
#endif
}

void get_wifi_ap_response(uint8_t *buf, uint32_t len)
{
	if(len > 9)//head(1)+len(2)+ID(2)+status(1)+control(1)+CRC(1)+end(1)
		wifi_receive_data_handle(&buf[7], len-9);
}

void MCU_get_wifi_version(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (GET_WIFI_VER_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_WIFI_VER_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_get_wifi_mac_address(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (GET_WIFI_MAC_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_WIFI_MAC_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_get_wifi_ap(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (GET_WIFI_AP_ID>>8);		
	reply[reply_len++] = (uint8_t)(GET_WIFI_AP_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_set_wifi_off(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (SET_WIFI_OFF_ID>>8);		
	reply[reply_len++] = (uint8_t)(SET_WIFI_OFF_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_set_wifi_on(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (SET_WIFI_ON_ID>>8);		
	reply[reply_len++] = (uint8_t)(SET_WIFI_ON_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_set_wifi_ap(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (SET_WIFI_CONNECTED_AP_ID>>8);		
	reply[reply_len++] = (uint8_t)(SET_WIFI_CONNECTED_AP_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_set_wifi_server(void)
{
	uint8_t reply[128] = {0};
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	//packet head
	reply[reply_len++] = PACKET_HEAD;
	//data_len
	reply[reply_len++] = 0x00;
	reply[reply_len++] = 0x00;
	//data ID
	reply[reply_len++] = (SET_WIIF_CONNECTED_SEVER_ID>>8);		
	reply[reply_len++] = (uint8_t)(SET_WIIF_CONNECTED_SEVER_ID&0x00ff);
	//status
	reply[reply_len++] = 0x80;
	//control
	reply[reply_len++] = 0x00;
	//CRC
	reply[reply_len++] = 0x00;
	//packet end
	reply[reply_len++] = PACKET_END;

	//Adjust data length
	reply[1] = (reply_len-3)>>8;
	reply[2] = (reply_len-3)&0x00ff;

	for(i=0;i<(reply_len-2);i++)
		reply[reply_len-2] += reply[i];

	BleSendData(reply, reply_len);
}

void MCU_send_wifi_data(uint8_t *data, uint32_t len)
{
	uint8_t *reply;
	uint16_t i,reply_len = 0;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	reply = k_malloc(len+9);
	if(reply != NULL) 
	{
		memset(reply, 0x00, len+9);
		
		//packet head
		reply[reply_len++] = PACKET_HEAD;
		//data_len
		reply[reply_len++] = 0x00;
		reply[reply_len++] = 0x00;
		//data ID
		reply[reply_len++] = (SEND_WIFI_DATA_ID>>8);		
		reply[reply_len++] = (uint8_t)(SEND_WIFI_DATA_ID&0x00ff);
		//status
		reply[reply_len++] = 0x80;
		//control
		reply[reply_len++] = 0x00;
		//date context
		memcpy(&reply[reply_len], data, len);
		reply_len += len;
		//CRC
		reply[reply_len++] = 0x00;
		//packet end
		reply[reply_len++] = PACKET_END;
		
