duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
#ifdef CONFIG_WIFI_SUPPORT
	case GET_WIFI_VER_ID:
		get_wifi_ver_response(buf, len);
		break;
	case GET_WIFI_MAC_ID:
		get_wifi_mac_response(buf, len);
		break; 
	case GET_WIFI_AP_ID:
		get_wifi_ap_response(buf, len);
		break; 
	case SEND_WIFI_DATA_ID:
		MCU_receive_wifi_data(buf, len);
		break;
#endif

	default:
	#ifdef UART_DEBUG	
		LOGD("data_id is unknown!");
	#endif
		break;
	}
}

void mcu_wakeup_nrf5340(void)
{
	if(!gpio_ble)
	{
		gpio_ble = DEVICE_DT_GET(BLE_PORT);
		if(!gpio_ble)
		{
		#ifdef UART_DEBUG
			LOGD("Cannot bind gpio device");
		#endif
			return;
		}

		gpio_pin_configure(gpio_ble, BLE_WAKE_PIN, GPIO_OUTPUT);
	}

	gpio_pin_set(gpio_ble, BLE_WAKE_PIN, 0);
	k_sleep(K_MSEC(10));
	gpio_pin_set(gpio_ble, BLE_WAKE_PIN, 1);
}

void uart_send_data_handle(uint8_t *buffer, uint32_t datalen)
{
	uint32_t sendlen = 0;

	mcu_wakeup_nrf5340();
#ifdef CONFIG_PM_DEVICE
	uart_ble_sleep_out();
#endif

	while(sendlen < datalen)
	{
		sendlen += uart_fifo_fill(uart_ble, &buffer[sendlen], datalen-sendlen);
		uart_irq_tx_enable(uart_ble);
	}
}

void UartSendData(void)
{
	uint8_t data_type,*p_data;
	uint32_t data_len;
	int ret;

	ret = get_data_from_cache(&uart_send_cache, &p_data, &data_len, &data_type);
	if(ret)
	{
		uart_send_data_handle(p_data, data_len);
		delete_data_from_cache(&uart_send_cache);

		k_timer_start(&uart_send_data_timer, K_MSEC(50), K_NO_WAIT);
	}
}

void BleSendDataStart(void)
{
	k_timer_start(&uart_send_data_timer, K_MSEC(50), K_NO_WAIT);
}

void BleSendData(uint8_t *data, uint32_t datalen)
{
	int ret;

	ret = add_data_into_cache(&uart_send_cache, data, datalen, DATA_TRANSFER);
	BleSendDataStart();
}

static void uart_receive_data_handle(uint8_t *data, uint32_t datalen)
{
	uint32_t data_len = 0;

#ifdef CONFIG_PM_DEVICE
	if(!uart_ble_is_waked)
		return;
#endif

	data_len = (256*data[1]+data[2]+3);
    if(datalen == data_len)
    {
        ble_receive_data_handle(data, datalen);
    }
}

void UartReceData(void)
{
	uint8_t data_type,*p_data;
	uint32_t data_len;
	int ret;

	ret = get_data_from_cache(&uart_rece_cache, &p_data, &data_len, &data_type);
	if(ret)
	{
		uart_receive_data_handle(p_data, data_len);
		delete_data_from_cache(&uart_rece_cache);

		k_timer_start(&uart_rece_data_timer, K_MSEC(50), K_NO_WAIT);
	}
}

void BleReceDataStart(void)
{
	k_timer_start(&uart_rece_data_timer, K_MSEC(50), K_NO_WAIT);
}

void BleReceData(uint8_t *data, uint32_t datalen)
{
	int ret;

	ret = add_data_into_cache(&uart_rece_cache, data, datalen, DATA_TRANSFER);
	BleReceDataStart();
}

static void uart_cb(struct device *x)
{
	uint8_t tmpbyte = 0;
	uint32_t len=0;

	uart_irq_update(x);

	if(uart_irq_rx_ready(x)) 
	{
		if(rece_len >= BUF_MAXSIZE)
			rece_len = 0;

		while((len = uart_fifo_read(x, &rx_buf[rece_len], BUF_MAXSIZE-rece_len)) > 0)
		{
			rece_len += len;
			k_timer_start(&uart_rece_frame_timer, K_MSEC(20), K_NO_WAIT);
		}
	}
	
	if(uart_irq_tx_ready(x))
	{
		struct uart_data_t *buf;
		uint16_t written = 0;

		buf = k_fifo_get(&fifo_uart_tx_data, K_NO_WAIT);
		/* Nothing in the FIFO, nothing to send */
		if(!buf)
		{
			uart_irq_tx_disable(x);
			return;
		}

		while(buf->len > written)
		{
			written += uart_fifo_fill(x, &buf->data[written], buf->len - written);
		}

		while (!uart_irq_tx_complete(x))
		{
			/* Wait for the last byte to get
			* shifted out of the module
			*/
		}

		if (k_fifo_is_empty(&fifo_uart_tx_data))
		{
			uart_irq_tx_disable(x);
		}

		k_free(buf);
	}
}

#ifdef CONFIG_PM_DEVICE
void uart_ble_sleep_out(void)
{
	if(k_timer_remaining_get(&uart_ble_sleep_in_timer) > 0)
		k_timer_stop(&uart_ble_sleep_in_timer);
	k_timer_start(&uart_ble_sleep_in_timer, K_SECONDS(UART_BLE_WAKE_HOLD_TIME_SEC), K_NO_WAIT);

	if(uart_ble_is_waked)
		return;

	pm_device_action_run(uart_ble, PM_DEVICE_ACTION_RESUME);
	uart_ble_is_waked = true;

#ifdef UART_DEBUG
	LOGD("uart ble set active success!");
#endif
}

void uart_ble_sleep_in(void)
{	
	if(!uart_ble_is_waked)
		return;

	pm_device_action_run(uart_ble, PM_DEVICE_ACTION_SUSPEND);
	uart_ble_is_waked = false;

#ifdef UART_DEBUG
	LOGD("uart ble set low power success!");
#endif
}

static void ble_interrupt_event(struct device *interrupt, struct gpio_callback *cb, uint32_t pins)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_wake_flag = true;
}

static void UartBleSleepInCallBack(struct k_timer *timer_id)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif
	uart_ble_sleep_flag = true;
}
#endif

static void GetBLEInfoCallBack(struct k_timer *timer_id)
{
	get_ble_info_flag = true;
}

static void UartSendDataCallBack(struct k_timer *timer)
{
	uart_send_data_flag = true;
}

static void UartReceDataCallBack(struct k_timer *timer_id)
{
	uart_rece_data_flag = true;
}

static void UartReceFrameCallBack(struct k_timer *timer_id)
{
	uart_rece_frame_flag = true;
}

void ble_init(void)
{
	gpio_flags_t flag = GPIO_INPUT|GPIO_PULL_UP;

#ifdef UART_DEBUG
	LOGD("begin");
#endif

	uart_ble = DEVICE_DT_GET(BLE_DEV);
	if(!uart_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get uart!");
	#endif
		return;
	}

	uart_irq_callback_set(uart_ble, uart_cb);
	uart_irq_rx_enable(uart_ble);

	gpio_ble = DEVICE_DT_GET(BLE_PORT);
	if(!gpio_ble)
	{
	#ifdef UART_DEBUG
		LOGD("Could not get gpio!");
	#endif
		return;
	}	
	gpio_pin_configure(gpio_ble, BLE_WAKE_PIN, GPIO_OUTPUT);
	gpio_pin_set(gpio_ble, BLE_WAKE_PIN, 1);

#ifdef CONFIG_PM_DEVICE
	gpio_pin_configure(gpio_ble, BLE_INT_PIN, flag);
	gpio_pin_interrupt_configure(gpio_ble, BLE_INT_PIN, GPIO_INT_DISABLE);
	gpio_init_callback(&gpio_cb, ble_interrupt_event, BIT(BLE_INT_PIN));
	gpio_add_callback(gpio_ble, &gpio_cb);
	gpio_pin_interrupt_configure(gpio_ble, BLE_INT_PIN, GPIO_INT_ENABLE|GPIO_INT_EDGE_FALLING);	
	k_timer_start(&uart_ble_sleep_in_timer, K_SECONDS(UART_BLE_WAKE_HOLD_TIME_SEC), K_NO_WAIT);
#endif

	k_timer_start(&get_ble_info_timer, K_SECONDS(2), K_NO_WAIT);
}

void UartMsgProc(void)
{
#ifdef CONFIG_PM_DEVICE
	if(uart_ble_wake_flag)
	{
		uart_ble_wake_flag = false;
		uart_ble_sleep_out();
	}

	if(uart_ble_sleep_flag)
	{
		uart_ble_sleep_flag = false;
		uart_ble_sleep_in();
	}
#endif/*CONFIG_PM_DEVICE*/

	if(uart_send_data_flag)
	{
		UartSendData();
		uart_send_data_flag = false;
	}

