duxinglang-1/nRF9160_test/E2_V4_TEST/src/uart_ble/uart_ble.c
	if(uart_rece_data_flag)
	{
		UartReceData();
		uart_rece_data_flag = false;
	}
	
	if(uart_rece_frame_flag)
	{
		uart_receive_data_handle(rx_buf, rece_len);
		rece_len = 0;
		uart_rece_frame_flag = false;
	}
	
	if(redraw_blt_status_flag)
	{
		if((screen_id == SCREEN_ID_IDLE)
			||(screen_id == SCREEN_ID_HR)
			||(screen_id == SCREEN_ID_SPO2)
			||(screen_id == SCREEN_ID_BP)
			||(screen_id == SCREEN_ID_TEMP)
			||(screen_id == SCREEN_ID_STEPS)
			||(screen_id == SCREEN_ID_SLEEP)
			)
		{
			scr_msg[screen_id].para |= SCREEN_EVENT_UPDATE_BLE;
			scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
		}
		
		redraw_blt_status_flag = false;
	}

	if(get_ble_info_flag)
	{
		static uint8_t index = 0;
		switch(index)
		{
		case 0:
			index++;
			MCU_get_ble_ver();
			k_timer_start(&get_ble_info_timer, K_MSEC(100), K_NO_WAIT);
			break;
		case 1:
			index++;
			MCU_get_ble_mac_address();
			k_timer_start(&get_ble_info_timer, K_MSEC(100), K_NO_WAIT);
			break;
			
	#ifdef CONFIG_BLE_SUPPORT	
		case 2:
			MCU_get_ble_status();
			break;
	#else
		//case 2:
		//	MCU_set_ble_work_mode(BLE_MODE_TURN_OFF);
		//	break;
	#endif	
		}

		get_ble_info_flag = false;
	}

#ifdef CONFIG_BLE_SUPPORT
	if(reply_cur_data_flag)
	{
		APP_get_cur_hour_sport(refresh_time);
		APP_get_cur_hour_health(refresh_time);
		reply_cur_data_flag = false;
	}
#endif
}

void test_uart_ble(void)
{
#ifdef UART_DEBUG
	LOGD("begin");
#endif

	while(1)
	{
		BleSendData("Hello World!\n", strlen("Hello World!\n"));
		k_sleep(K_MSEC(1000));
	}
}
